/*


	ВНИМАНИЕ !!!  в этот файл записываем только обЪявления структур, перечислений,
	прототипы функций, define и т.д.
	
	ВНИМАНИЕ !!! в этот файл записывать нельзя объявление переменных, обЪявления функций,
	инициализация структур и переменных, выделять память и т.д это все делаем в файле.с
	
	
	
  ******************************************************************************
  * @file 			( фаил ):   SV17F.h
  * @brief 		( описание ):  	
  ******************************************************************************
  * @attention 	( внимание ):
  ******************************************************************************
  
*/

#ifndef _SV17F_H
#define _SV17F_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ----------------------------------------------------------*/

// Обязательно нужен #include "main.h" 
// чтоб отдельно не подключать файлы связанные с МК и стандартными библиотеками
#include "main.h"


// установить диск откуда воспроизводить будем
#define NO_DEVICE		0xFF
#define USB_DEVICE		0x00
#define SD_DEVICE		0x01
#define FLASH_DEVICE	0x02

// установить эквалайзер
#define OFF				0x00
#define POP				0x01
#define ROCK			0x02
#define JAZZ			0x03
#define CLASSIC			0x04




/* Functions prototypes ----------------------------------------------*/

void SV17F_Play( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Pause( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Stop( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Previous_song( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Next_song( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Volume_up( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Volume_down( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Previous_file( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Next_file( UART_HandleTypeDef *UART );
//-----------------------------------------------------------------------------------------------

void SV17F_Stop_play( UART_HandleTypeDef *UART );
////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

////////   функции настройки модуля   //////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

// установка громкости от 0 до 30 по умолчанию стоит 20
void SV17F_Set_Volume( UART_HandleTypeDef *UART, uint8_t volume );
//-------------------------------------------------------------------------------------------------------------------------

// установить режим повтора от 0 до 7
// 0x00 - воспр. все песни покругу
// 0x01 - воспр. текущую песню по кругу
// 0x02 - воспр. текущую песню 1 раз и останавливаеться
// 0x03 - воспр. рандомную песню
// 0x04 - воспр. попорядку в текущей папке
// 0x05 - воспр. рандомно в текущей папке
// 0x06 - воспр. все песни по порядку в текущей папке и останавливаеться
// 0x07 - воспр. все песни и останавливаеться
void SV17F_Set_Replay_mode( UART_HandleTypeDef *UART, uint8_t mode );
//-------------------------------------------------------------------------------------------------------------------------

void SV17F_Set_Replay_time( UART_HandleTypeDef *UART, uint16_t time );
//-------------------------------------------------------------------------------------------------------------------------

// указываем номер песни и она сама воспроизводится
void SV17F_Set_song( UART_HandleTypeDef *UART, uint16_t song );
//-------------------------------------------------------------------------------------------------------------------------

// установить эквалайзер
void SV17F_Set_EQ( UART_HandleTypeDef *UART, uint8_t EQ );
//-------------------------------------------------------------------------------------------------------------------------

// установить диск откуда воспроизводить будем
void SV17F_Set_Disk( UART_HandleTypeDef *UART, uint8_t disk );
//-------------------------------------------------------------------------------------------------------------------------

// указываем путь
void SV17F_Set_Path( UART_HandleTypeDef *UART, uint8_t disk, uint8_t path );
//-------------------------------------------------------------------------------------------------------------------------


// указываем номер песни без воспроизведения
void SV17F_Set_song_noPlay( UART_HandleTypeDef *UART, uint16_t song );
//------------------------------------------------------------------------------------


#ifdef __cplusplus
}
#endif

#endif	/*	_SV17F_H */

/************************ (C) COPYRIGHT GKP *****END OF FILE****/
